; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	GroundStation1 - direction
	Star6 - direction
	Star2 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(have_image Star7 thermograph0)
	(have_image Planet8 thermograph2)
	(have_image Phenomenon9 image1)
))

)

; plan
1. (turn_to satellite2 groundstation0 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 4
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 4
3. (calibrate satellite2 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 4
4. (turn_to satellite2 phenomenon9 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 4
5. (turn_to satellite1 groundstation3 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 4
6. (take_image satellite2 phenomenon9 instrument2 image1)
   added: (have_image phenomenon9 image1)
   goals met: 2 of 4
7. (turn_to satellite2 planet8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet8)
   goals met: 2 of 4
8. (take_image satellite2 planet8 instrument2 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 3 of 4
9. (turn_to satellite2 star7 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star7)
   goals met: 3 of 4
10. (take_image satellite2 star7 instrument2 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 4 of 4
